# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'caskroom/drivers'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'
brew 'bash-completion'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'git'
brew 'tree'
brew 'mas'
brew 'wget'
brew 'autoconf'
brew 'ssh-copy-id'
brew 'tree'
brew 'watch'
brew 'unrar'
brew 'wget'
brew 'htop-osx'
brew 'gist'
brew 'dockutil'
brew 'node'
brew 'heroku'
brew 'tig'
brew 'sshfs'

# Apps
cask 'phpstorm'
cask 'sequel-pro'
cask 'google-chrome'
cask 'firefox'
cask 'opera'
cask 'caffeine'
cask 'spectacle'
cask 'slack'
cask 'transmission'
cask 'google-backup-and-sync'
cask 'google-hangouts'
cask 'mactracker'
cask 'flux'
cask 'dropbox'
cask 'disk-inventory-x'
cask 'dash'
cask 'sublime-text'
cask 'skype'
cask 'docker'
cask 'garmin-express'
cask 'gimp'
cask 'vlc'
cask 'spotify'
cask 'telegram'
cask 'atext'
cask 'libreoffice'
cask 'sonos'
cask 'atom'
cask 'postman'
cask 'tunnelblick'
cask 'osxfuse'
cask 'portfolioperformance'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

mas '1Password', id: 443987910
mas 'TweetDeck by Twitter', id: 485812721
mas 'Keynote', id: 409183694
